# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 512]  # max_channels reduced to half

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2 (64 -> 32)
  - [-1, 1, Conv, [64, 3, 1]] # 1 (128 -> 64)
  - [-1, 1, space_to_depth, [1]] # 2-P2/4
  - [-1, 3, C2f, [64, True]] # 3 (128 -> 64)
  - [-1, 1, Conv, [128, 3, 1]] # 4 (256 -> 128)
  - [-1, 1, space_to_depth, [1]] # 5-P3/8
  - [-1, 6, C2f, [128, True]] # 6 (256 -> 128)
  - [-1, 1, Conv, [256, 3, 1]] # 7 (512 -> 256)
  - [-1, 1, space_to_depth, [1]] # 8-P4/16
  - [-1, 6, C2f, [256, True]] # 9 (512 -> 256)
  - [-1, 1, Conv, [512, 3, 1]] # 10 (1024 -> 512)
  - [-1, 1, space_to_depth, [1]] # 11-P5/32
  - [-1, 3, C2f, [512, True]] # 12 (1024 -> 512)
  - [-1, 1, SPPF, [512, 5]] # 13 (1024 -> 512)
  - [-1, 1, PSA, [512]] # 14 (1024 -> 512)

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256]]  # 17

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128]]  # 20 (P3/8-small)
  - [ -1, 1, CBAM, [ 7 ] ] # 21

  - [-1, 1, LPC, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [256]]  # 24 (P4/16-medium)

  - [-1, 1, LPC, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [512]]  # 27 (P5/32-large)

  - [[20, 23, 26], 1, v10Detect, [nc]] # Detect(P3, P4, P5)